_Rarzrabotki/Rarus/USO2/Documents/уатОтчетПоставщикаПЦ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>уатОтчетПоставщикаПЦ</Name>
			<Comment>(уат)</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.уатОборотыПоОтчетамПоставщиковПЦ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АЗС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатАЗС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВключаетНДС</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьНДС</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокТС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Заправки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГСМ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МестоЗаправкиКод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МестоЗаправкиНаименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураОтчета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПластиковаяКарта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТопливныеКарты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПластиковаяКартаОтчета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проверено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТСОтчета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/уатНоменклатураГСМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>уатНоменклатураГСМ</Name>
			<Comment>Доп. сведения для ГСМ</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВестиУчетОстатковТЖ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппаГСМ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатГруппыГСМ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГСМТалона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛитровыйТалон</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НоминалТалона</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Плотность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/уатГруппыГСМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>уатГруппыГСМ</Name>
			<Comment>(уат)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Топливо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Масло</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Талон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрисадкиИТехническиеЖидкости</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/уатАЗС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>уатАЗС</Name>
			<Comment>(уат)</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент_Склад</Name>
					<Comment>Контрагент / склад</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоАЗССклад</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлВнешнейОбработки</Name>
					<Comment>Хранилище данных файла внешней обработки</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоответствиеГСМ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГСМизФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГСМ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Адреса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПунктНазначения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатПунктыНазначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/уатОтчетПоставщикаПЦ/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	об = РеквизитФормыВЗначение("Объект");
	уатЗащищенныеФункцииСервер.уатДокументФормаЭлементаПриСозданииНаСервере(об, Отказ, СтандартнаяОбработка, ЭтаФорма, ДопПараметрыОткрытие);
	ЗначениеВРеквизитФормы(Об,"Объект");
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	уатОбщегоНазначенияСервер.ЗаполнитьШапкуДокумента(
		Объект,
		,
		Параметры.ЗначениеКопирования,
		Параметры.Основание,
		,
		,
		,
		Параметры.ЗначенияЗаполнения
	);
	
	// Установка реквизитов формы.
	ДатаДокумента = Объект.Дата;
	Если НЕ ЗначениеЗаполнено(ДатаДокумента) Тогда
		ДатаДокумента = ТекущаяДата();
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить();
		Объект.УчитыватьНДС = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(Объект.Организация, "УчитыватьНДС");
		Объект.СуммаВключаетНДС = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(Объект.Организация, "СуммаВключаетНДС");
	КонецЕсли;
	
	Элементы.Контрагент.Видимость = НЕ Объект.АЗС.ЭтоАЗССклад;
	
	ПредУчитыватьНДС = Объект.УчитыватьНДС;
	ПредСуммаВключаетНДС = Объект.СуммаВключаетНДС;
	
	СтавкаНДСпоУмолчанию = уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(
		ПользователиКлиентСервер.АвторизованныйПользователь(), "ОсновнаяСтавкаНДС");
	ЗаполнитьСтавкиНДССервер();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	уатЗащищенныеФункцииКлиент.уатДокументФормаЭлементаПриОткрытии(Отказ, ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьВсегоВТЧЗаправки();
	УстановитьВидимость();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ОбновитьВсегоВТЧЗаправки();
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	КонтрольЗаполненияСтавкиНДС(Отказ);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если флВопросЗакрытиеФормы Тогда
		Отказ = Истина;
		Оповещ = Новый ОписаниеОповещения("ПередЗакрытиемВопрос", ЭтотОбъект);
		ПоказатьВопрос(Оповещ, "При проверке корректности заполнения документа возникли предупреждения!
			|Продолжить закрытие формы?", РежимДиалогаВопрос.ОКОтмена);
	ИначеЕсли Модифицированность И НЕ Объект.Ссылка.Пустая() Тогда
		КонтрольЗаполненияСтавкиНДС(Отказ, Истина);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ДатаПередИзменением = ДатаДокумента;
	ДатаДокумента = Объект.Дата;
	Если Объект.Дата <> ДатаПередИзменением Тогда
		СтруктураДанные = ПолучитьДанныеДатаПриИзменении(Объект.Ссылка, Объект.Дата, ДатаПередИзменением);
		Если СтруктураДанные.РазностьДат <> 0 Тогда
			//Объект.Номер = "";
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура АЗСПриИзменении(Элемент)
	Объект.Контрагент = уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Объект.АЗС, "Контрагент_Склад");
	
	ЭтоАЗСсклад = (уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Объект.АЗС, "ЭтоАЗССклад") = Истина);
	Если Элементы.Контрагент.Видимость = ЭтоАЗССклад Тогда
		Элементы.Контрагент.Видимость = НЕ ЭтоАЗССклад;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
КонецПроцедуры

&НаКлиенте
Процедура УчитыватьНДСПриИзменении(Элемент)
	Если НЕ Объект.УчитыватьНДС Тогда
		Объект.СуммаВключаетНДС = Ложь;
	КонецЕсли;
	
	ПриИзмененииПараметровНДСиКурса();
КонецПроцедуры

&НаКлиенте
Процедура СуммаВключаетНДСПриИзменении(Элемент)
	ПриИзмененииПараметровНДСиКурса();
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПараметровНДСиКурса()
	// Пересчитываем сумму если изменился признак Налогообложение НДС.
	Если Объект.УчитыватьНДС <> ПредУчитыватьНДС Тогда
		УстановитьВидимость();
		РассчитатьСуммуНДСвТабЧасти();
	КонецЕсли;
	
	// Пересчитываем сумму если изменился признак "Сумма включает НДС".
	Если Объект.СуммаВключаетНДС <> ПредСуммаВключаетНДС Тогда
		РассчитатьСуммуНДСвТабЧасти();
	КонецЕсли;
	
	ВывестиСуммовыеИтогиДокумента();
	ОбновитьВсегоВТЧЗаправки();
	
	ПредУчитыватьНДС = Объект.УчитыватьНДС;
	ПредСуммаВключаетНДС = Объект.СуммаВключаетНДС;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗаправки

&НаКлиенте
Процедура ЗаправкиТСНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтруктураОтбор = Новый Структура("уатОрганизация", Объект.Организация);
	уатИнтерфейсВводаТС.РеквизитТСНачалоВыбора(Элемент, Элементы.Заправки.ТекущиеДанные.ТС, ДанныеВыбора, СтандартнаяОбработка, СтруктураОтбор);
КонецПроцедуры

&НаКлиенте
Процедура ЗаправкиТСАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	СтруктураОтбор = Новый Структура("уатОрганизация", Объект.Организация);
	уатИнтерфейсВводаТС.РеквизитТСАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка, СтруктураОтбор);
КонецПроцедуры

&НаКлиенте
Процедура ЗаправкиТСОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	СтруктураОтбор = Новый Структура("уатОрганизация", Объект.Организация);
	уатИнтерфейсВводаТС.РеквизитТСОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка, СтруктураОтбор);
КонецПроцедуры

&НаКлиенте
Процедура ЗаправкиГСМНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ТекСтрока = Элементы.Заправки.ТекущиеДанные;
	ДопПараметры = Новый Структура("ЗначениеГСМДоИзменения, ИмяПроцедурыОписаниеОповещения", ТекСтрока.ГСМ, "ОписаниеОповещенияВыбораГСМ");
	уатЗащищенныеФункцииКлиент.СписокГСМдляТС(Объект.Организация, ТекСтрока.ТС,
		ПредопределенноеЗначение("Перечисление.уатГруппыГСМ.Топливо"),, Истина, ЭтаФорма, ДопПараметры);
КонецПроцедуры

&НаКлиенте
Процедура ЗаправкиГСМПриИзменении(Элемент)
	ТекСтрока = Элементы.Заправки.ТекущиеДанные;
	ЗаполнитьСтавкуНДСвТекущейСтроке(ТекСтрока);
КонецПроцедуры

// Подключаемый динамически обработчик оповещения
&НаКлиенте
Процедура ОписаниеОповещенияВыбораГСМ(Результат, ДопПараметры) Экспорт
	Если Результат <> Неопределено Тогда
		Элементы.Заправки.ТекущиеДанные.ГСМ = Результат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаправкиГСМАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ТекСтрока = Элементы.Заправки.ТекущиеДанные;
	
	СтандартнаяОбработка = Ложь;
	мсвГруппДляОтбора = Новый Массив;
	мсвГруппДляОтбора.Добавить(ПредопределенноеЗначение("Перечисление.уатГруппыГСМ.Топливо"));
	ДопПараметры = Новый Структура("ТС, Организация, УчитыватьТЖ", ТекСтрока.ТС, Объект.Организация, Истина);
	ДанныеВыбора = уатГСМ.ПолучитьСписокАвтоподбораПоляГСМ(Текст, мсвГруппДляОтбора, ДопПараметры);
КонецПроцедуры

&НаКлиенте
Процедура ЗаправкиГСМОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ПараметрыПолученияДанных.СтрокаПоиска = "";
КонецПроцедуры

&НаКлиенте
Процедура ЗаправкиПластиковаяКартаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.уатТопливныеКарты.ФормаВыбора",, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ЗаправкиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ОбновитьВсегоВТЧЗаправки();
КонецПроцедуры

&НаКлиенте
Процедура ЗаправкиПослеУдаления(Элемент)
	ОбновитьВсегоВТЧЗаправки();
КонецПроцедуры

&НаКлиенте
Процедура ЗаправкиСуммаПриИзменении(Элемент)
	РассчитатьСуммуВсегоВстрокеТЧ(Элементы.Заправки.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ЗаправкиСтавкаНДСПриИзменении(Элемент)
	РассчитатьСуммуНДСвТабЧасти();
	РассчитатьСуммуВсегоВстрокеТЧ(Элементы.Заправки.ТекущиеДанные);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ЗагрузитьЗаправкиИзФайла(Команда)
	ОбработкаЗагрузкиПолноеИмя = ПолучитьОбработкуЗагрузки();
	
    Если НЕ ЗначениеЗаполнено(ОбработкаЗагрузкиПолноеИмя) Тогда
		ТекстНСТР = НСтр("en='Incorrect name of the processing for loading of gas station data!"
"To correct, make changes to catalog ""Gas station""';ru='Неправильное имя обработки для загрузки данных АЗС!"
"Для исправления внесите изменения в справочник ""АЗС""'");
		ПоказатьПредупреждение(Неопределено, ТекстНСТР);
        Возврат;				
	КонецЕсли;
	
	Если Объект.Заправки.Количество() > 0 Тогда
		ТекстНСТР = НСтр("en='Clear refueling table before download?';ru='Очистить таблицу заправок перед загрузкой?'");
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗагрузитьЗаправкиИзФайлаВопрос", ЭтотОбъект,
			Новый Структура("ОбработкаЗагрузкиПолноеИмя", ОбработкаЗагрузкиПолноеИмя)),
			ТекстНСТР, РежимДиалогаВопрос.ДаНетОтмена);
		Возврат;
	КонецЕсли;
	
	ЗагрузитьЗаправкиИзФайлаПродолжение(ОбработкаЗагрузкиПолноеИмя);
КонецПроцедуры

&НаКлиенте
Процедура ЗаправкиОтметитьВсе(Команда)
	Для Каждого ТекСтрока Из Объект.Заправки Цикл
		ТекСтрока.Проверено = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаправкиСнятьВсе(Команда)
	Для Каждого ТекСтрока Из Объект.Заправки Цикл
		ТекСтрока.Проверено = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗаправки(Команда)
	ЗаполнитьВсе();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьГСМиКарты(Команда)
	НайтиЗаполнитьГСМиКарты();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТСпоКартам(Команда)
	НайтиЗаполнитьТСпоКартам();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСтавкуНДС(Команда)
	
	Если Объект.УчитыватьНДС Тогда
		ИндексСтавки = СтрЗаменить(Команда.Имя, "ЗаполнитьСтавкуНДС_", "");
		ИндексСтавки = Число(ИндексСтавки);
		
		ЗаполнитьСтавкиНДСвСтроках(ИндексСтавки);
		РассчитатьСуммуНДСвТабЧасти();
		ОбновитьВсегоВТЧЗаправки();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьЦеныТабличнойЧастиПоВалюте(ВалютаРасчетовПередИзменением, ИмяТЧ)
	уатОбщегоНазначенияСервер.ПересчитатьЦеныТабличнойЧастиПоВалюте(Объект, ВалютаРасчетовПередИзменением, ИмяТЧ);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаСервереБезКонтекста
Функция ПолучитьДанныеДатаПриИзменении(ДокументСсылка, ДатаНовая, ДатаПередИзменением)
	
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("РазностьДат", уатОбщегоНазначенияСервер.ПроверитьНомерДокумента(ДокументСсылка, ДатаНовая,
								ДатаПередИзменением));
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеДатаПриИзменении()

//Функция ищет ГСМ
&НаСервереБезКонтекста
Функция НайтиГСМвБазе(мНоменклатураОтчета, мАЗС)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА рсГСМ.ГСМ ЕСТЬ NULL 
	|			ТОГДА спрАЗС.ГСМ
	|		ИНАЧЕ рсГСМ.ГСМ
	|	КОНЕЦ КАК ГСМ
	|ИЗ
	|	(ВЫБРАТЬ ПЕРВЫЕ 1
	|		уатНоменклатураГСМ.Номенклатура КАК ГСМ
	|	ИЗ
	|		РегистрСведений.уатНоменклатураГСМ КАК уатНоменклатураГСМ
	|	ГДЕ
	|		уатНоменклатураГСМ.Номенклатура.Наименование = &НоменклатураОтчета) КАК рсГСМ
	|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ ПЕРВЫЕ 1
	|			уатАЗССоответствиеГСМ.ГСМ КАК ГСМ
	|		ИЗ
	|			Справочник.уатАЗС.СоответствиеГСМ КАК уатАЗССоответствиеГСМ
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.уатАЗС КАК уатАЗС
	|				ПО уатАЗССоответствиеГСМ.Ссылка = уатАЗС.Ссылка
	|		ГДЕ
	|			уатАЗС.Ссылка = &АЗС
	|			И уатАЗССоответствиеГСМ.ГСМизФайла = &НоменклатураОтчета) КАК спрАЗС
	|		ПО рсГСМ.ГСМ = спрАЗС.ГСМ";
	
	Запрос.УстановитьПараметр("АЗС", мАЗС);
	Запрос.УстановитьПараметр("НоменклатураОтчета", СокрЛП(мНоменклатураОтчета));
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Если РезультатЗапроса.Следующий() Тогда
		
		
		Возврат РезультатЗапроса.ГСМ;
	Иначе
		Возврат "";
	КонецЕсли;	
	
КонецФункции	

//Функция ищет карточку
&НаСервереБезКонтекста
Функция НайтиКартуВБазе(мПластиковаяКартаОтчета)
	
	Запрос = Новый Запрос;
	 
	Запрос.Текст = 
	  "ВЫБРАТЬ
	  |	уатПластиковыеКарты.Ссылка КАК Карта
	  |ИЗ
	  |	Справочник.уатТопливныеКарты КАК уатПластиковыеКарты
	  |ГДЕ
	  |	уатПластиковыеКарты.Код = &ПластиковаяКартаОтчета";
	 
	 Запрос.УстановитьПараметр("ПластиковаяКартаОтчета",СокрЛП(мПластиковаяКартаОтчета));
	 РезультатЗапроса = Запрос.Выполнить().Выбрать();
	 Если РезультатЗапроса.Следующий() Тогда
	 	Возврат РезультатЗапроса.Карта;
	Иначе
		Возврат "";
	КонецЕсли;	
	 
КонецФункции	

&НаКлиенте
Процедура НайтиЗаполнитьГСМиКарты()
	КэшЗагрузкиГСМ.Очистить();
	КэшКарт.Очистить();
		
	//При первом проходе составляем таблицу ГСМ и карточек
	КолСтрок = Объект.Заправки.Количество();
	Инд = 0;
	ПредИндикатор = Неопределено;
	
	Для Каждого ТекСтрока Из Объект.Заправки Цикл
		ОбработкаПрерыванияПользователя();
		
		Инд = Инд + 1;
		ТекИндикатор = Цел(Инд / КолСтрок * 100 / 5);
		
		//найдем соответствующий ГСМ
		мсвСтрокиПоиска = КэшЗагрузкиГСМ.НайтиСтроки(Новый Структура("НоменклатураОтчета, АЗС", ТекСтрока.НоменклатураОтчета,
							Объект.АЗС));
		Если мсвСтрокиПоиска.Количество() = 0 Тогда
			ТекГСМ = НайтиГСМвБазе(ТекСтрока.НоменклатураОтчета, Объект.АЗС);
			ТекСтрока.ГСМ = ТекГСМ;
			
			НоваяСтрокаКэш = КэшЗагрузкиГСМ.Добавить();
			НоваяСтрокаКэш.НоменклатураОтчета = ТекСтрока.НоменклатураОтчета;
			НоваяСтрокаКэш.АЗС = Объект.АЗС;
			НоваяСтрокаКэш.ГСМ = ТекГСМ;
		Иначе	
			ТекСтрока.ГСМ = мсвСтрокиПоиска[0].ГСМ;
		КонецЕсли;
		
		//найдем соответствующую пластиковую карту
		мсвСтрокиПоиска = КэшКарт.НайтиСтроки(Новый Структура("ПластиковаяКартаОтчета", ТекСтрока.ПластиковаяКартаОтчета));
		Если мсвСтрокиПоиска.Количество() = 0 Тогда
			ТекКарта = НайтиКартуВБазе(ТекСтрока.ПластиковаяКартаОтчета);
			ТекСтрока.ПластиковаяКарта = ТекКарта;
			
			НоваяСтрокаКэш = КэшКарт.Добавить();
			НоваяСтрокаКэш.ПластиковаяКартаОтчета = ТекСтрока.ПластиковаяКартаОтчета;
			НоваяСтрокаКэш.ПластиковаяКарта = ТекКарта;
		Иначе	
			ТекСтрока.ПластиковаяКарта = мсвСтрокиПоиска[0].ПластиковаяКарта;
		КонецЕсли;
		
		Если ТекИндикатор <> ПредИндикатор Тогда //отображаем обновление состояния каждые 5% для ускорения вывода
			ТекстНСТР = НСтр("en='Identification of fuels and fuel cards ...';ru='Идентификация ГСМ и топливных карт ...'");
			Состояние(ТекстНСТР, Цел(Инд/КолСтрок * 100));
			ПредИндикатор = ТекИндикатор;
		КонецЕсли;

	КонецЦикла;
	
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура НайтиЗаполнитьТСпоКартам()
	КэшВладельцыКарты.Очистить();
	КэшТСизПЛ.Очистить();
		
	КолСтрок = Объект.Заправки.Количество();
	Инд = 0;
	ПредИндикатор = Неопределено;
	
	Для Каждого ТекСтрока Из Объект.Заправки Цикл
		ОбработкаПрерыванияПользователя();
		
		Инд = Инд + 1;
		ТекИндикатор = Цел(Инд / КолСтрок * 100 / 5);
		
		//найдем соответствующий ТС
		мсвСтрокиПоиска = КэшВладельцыКарты.НайтиСтроки(Новый Структура("ПластиковаяКарта, Дата", ТекСтрока.ПластиковаяКарта, ТекСтрока.Дата));
		Если мсвСтрокиПоиска.Количество() = 0 Тогда
			мВладелецКарты = уатОбщегоНазначения.уатВладелецПластиковойКарты(ТекСтрока.ПластиковаяКарта, ТекСтрока.Дата);
			
			НоваяСтрокаКэш = КэшВладельцыКарты.Добавить();
			НоваяСтрокаКэш.ПластиковаяКарта = ТекСтрока.ПластиковаяКарта;
			НоваяСтрокаКэш.Владелец = мВладелецКарты;
			НоваяСтрокаКэш.Дата = ТекСтрока.Дата;
		Иначе
			мВладелецКарты = мсвСтрокиПоиска[0].Владелец;
		КонецЕсли;
			
		//если карта закреплена за ТС - то все просто
		Если ТипЗнч(мВладелецКарты) = Тип("СправочникСсылка.ТранспортныеСредства") Тогда
			ТекСтрока.ТС = мВладелецКарты;
		ИначеЕсли ТипЗнч(мВладелецКарты) = Тип("СправочникСсылка.Сотрудники") Тогда
			//если за водителем - то вначале ищем п/л для водителя по дате заправки и из него берем ТС	
			мсвСтрокиПоиска = КэшТСизПЛ.НайтиСтроки(Новый Структура("Владелец, Дата", мВладелецКарты, ТекСтрока.Дата));
			Если мсвСтрокиПоиска.Количество() = 0 Тогда
				ТекСтрока.ТС = НайтиТСизПЛ(мВладелецКарты, ТекСтрока.Дата);
				
				НоваяСтрокаКэш = КэшТСизПЛ.Добавить();
				НоваяСтрокаКэш.Владелец = мВладелецКарты;
				НоваяСтрокаКэш.Дата = ТекСтрока.Дата;
				НоваяСтрокаКэш.ТС = ТекСтрока.ТС;
			Иначе
				ТекСтрока.ТС = мсвСтрокиПоиска[0].ТС;
			КонецЕсли;
		КонецЕсли;
		
		Если ТекИндикатор <> ПредИндикатор Тогда //отображаем обновление состояния каждые 5% для ускорения вывода
			ТекстНСТР = НСтр("en='Identification of vehicle by fuel cards ...';ru='Идентификация ТС по топливным картам ...'");
			Состояние(ТекстНСТР, ТекИндикатор*5, "");
			ПредИндикатор = ТекИндикатор;
		КонецЕсли;
		
	КонецЦикла;
	
	Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтавкиНДССервер()
	
	Для Сч = 0 По Перечисления.СтавкиНДС.Количество() - 1 Цикл
		Ставка = Перечисления.СтавкиНДС.Получить(Сч);
		
		Команда = Команды.Добавить("ЗаполнитьСтавкуНДС_" + Сч);
		Команда.Действие = "ЗаполнитьСтавкуНДС";
		НоваяКнопка = Элементы.Добавить("ЗаполнитьСтавкуНДС_" + Сч, Тип("КнопкаФормы"), Элементы.ЗаправкиЗаполнитьСтавкуНДС);
		НоваяКнопка.Вид        = ВидКнопкиФормы.КнопкаКоманднойПанели;
		НоваяКнопка.ИмяКоманды = Строка("ЗаполнитьСтавкуНДС_" + Сч);
		НоваяКнопка.Заголовок  = Строка(Ставка);
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НайтиТСизПЛ(мВладелецКарты, мДатаЗаправки)
	Если НЕ ЗначениеЗаполнено(мВладелецКарты) ИЛИ НЕ ЗначениеЗаполнено(мДатаЗаправки) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	//запрос для поиска путевого листа для водителя
	ЗапросПЛ = Новый Запрос;
	ЗапросПЛ.Текст = 
	
	"ВЫБРАТЬ
	|	уатПутевойЛист.ТранспортноеСредство КАК ТС
	|ПОМЕСТИТЬ втПересечения
	|ИЗ
	|	Документ.уатПутевойЛист КАК уатПутевойЛист
	|ГДЕ
	|	(уатПутевойЛист.Водитель1 = &Водитель
	|			ИЛИ уатПутевойЛист.Водитель2 = &Водитель)
	|	И &ДатаЗаправки МЕЖДУ уатПутевойЛист.ДатаВыезда И уатПутевойЛист.ДатаВозвращения
	|	И уатПутевойЛист.ПометкаУдаления <> ИСТИНА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	уатПутевойЛист.ТранспортноеСредство
	|ИЗ
	|	Документ.уатПутевойЛист КАК уатПутевойЛист
	|ГДЕ
	|	(уатПутевойЛист.Водитель1 = &Водитель
	|			ИЛИ уатПутевойЛист.Водитель2 = &Водитель)
	|	И уатПутевойЛист.ДатаВозвращения >= &ДатаЗаправкиНачало
	|	И уатПутевойЛист.ДатаВыезда <= &ДатаЗаправкиКонец
	|	И уатПутевойЛист.ПометкаУдаления <> ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	втПересечения.ТС КАК ТС
	|ИЗ
	|	втПересечения КАК втПересечения";
	
	ЗапросПЛ.УстановитьПараметр("Водитель", мВладелецКарты);
	ЗапросПЛ.УстановитьПараметр("ДатаЗаправки", мДатаЗаправки);
	ЗапросПЛ.УстановитьПараметр("ДатаЗаправкиНачало", НачалоДня(мДатаЗаправки));
	ЗапросПЛ.УстановитьПараметр("ДатаЗаправкиКонец", КонецДня(мДатаЗаправки));
	РезультатЗапроса = ЗапросПЛ.Выполнить().Выбрать();
	Если РезультатЗапроса.Следующий() Тогда
		Возврат РезультатЗапроса.ТС;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ЗаполнитьВсе()
	НайтиЗаполнитьГСМиКарты();
	НайтиЗаполнитьТСпоКартам();
КонецПроцедуры

//Функция возвращает обработку загрузки данных 
&НаСервере
Функция ПолучитьОбработкуЗагрузки()
	Рез = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	уатАЗС.ФайлВнешнейОбработки КАК Данные
	|ИЗ
	|	Справочник.уатАЗС КАК уатАЗС
	|ГДЕ
	|	уатАЗС.Ссылка = &Объект";
	
	Запрос.УстановитьПараметр("Объект", Объект.АЗС);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Если РезультатЗапроса.Следующий() Тогда
		ИмяФайлаОбработкиЗагрузки = ПолучитьИмяВременногоФайла(".epf");
		
		ОписаниеЗащитыОтОпасныхДействий = Неопределено;
		// Обход ошибки обычного приложения
		Если ТекущийРежимЗапуска() <> РежимЗапускаКлиентскогоПриложения.ОбычноеПриложение Тогда
			Попытка
				ОписаниеЗащитыОтОпасныхДействий = Новый ("ОписаниеЗащитыОтОпасныхДействий");
				ОписаниеЗащитыОтОпасныхДействий.ПредупреждатьОбОпасныхДействиях = Ложь;
			Исключение
				// Исключение возможно на предыдущих версиях платформы без механизма
				// защиты от опасных действий
			КонецПопытки;
		КонецЕсли;
		
		Попытка
			ТекДанные = РезультатЗапроса.Данные.Получить();
			ТекДанные.Записать(ИмяФайлаОбработкиЗагрузки);
			
			Если ОписаниеЗащитыОтОпасныхДействий = Неопределено Тогда
				// Предыдущие версии платформы без механизма защиты
				МенеджерОбработки = ВнешниеОбработки.Создать(ИмяФайлаОбработкиЗагрузки, Ложь);
			Иначе
				МенеджерОбработки = ВнешниеОбработки.Создать(
					ВнешниеОбработки.Подключить(
						ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ИмяФайлаОбработкиЗагрузки)),
						, 
						Ложь, 
						ОписаниеЗащитыОтОпасныхДействий
					)
				);
			КонецЕсли;
			
			ПолноеИмя = МенеджерОбработки.Метаданные().ПолноеИмя();
			Рез = ПолноеИмя;
			
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		КонецПопытки;
		
		// удаление врем. файла
		ВремФайл = Новый Файл(ИмяФайлаОбработкиЗагрузки);
		Если ВремФайл.Существует() Тогда
			Попытка
				УдалитьФайлы(ВремФайл);
			Исключение
				ТекстНСТР = НСтр("en='Failed to remove temporary file of data processor';ru='Не удалось удалить временный файл обработки'");
				ТекстНСТР = ТекстНСТР + Символы.ПС + ОписаниеОшибки();
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР);
			КонецПопытки;
		КонецЕсли;
			
	КонецЕсли;
	
	Возврат Рез;
КонецФункции // ПолучитьОбработкуЗагрузки

&НаКлиенте
Процедура ЗагрузитьЗаправкиИзФайлаВопрос(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Объект.Заправки.Очистить();
	ИначеЕсли РезультатВопроса = КодВозвратаДиалога.Нет Тогда
	Иначе
		Возврат;
    КонецЕсли;
	
	ЗагрузитьЗаправкиИзФайлаПродолжение(ДополнительныеПараметры.ОбработкаЗагрузкиПолноеИмя);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьЗаправкиИзФайлаПродолжение(ОбработкаЗагрузкиПолноеИмя)
    Попытка
		ОткрытьФорму(ОбработкаЗагрузкиПолноеИмя + ".Форма",,ЭтаФорма,,,, Новый ОписаниеОповещения("ЗагрузитьЗаправкиИзФайлаЗавершение", ЭтотОбъект),
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Исключение
		ТекстНСТР = НСтр("en='Error while filling tabular section ""Refueling"": ';ru='Ошибка при заполнении табличной части ""Заправки"": '");
		ТекстНСТР = ТекстНСТР + ОписаниеОшибки();
		ПоказатьПредупреждение(Неопределено, ТекстНСТР);
		Возврат;				
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьЗаправкиИзФайлаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено И ТипЗнч(Результат) = Тип("Массив") И Результат.Количество() > 0 Тогда
		Для Каждого ТекСтрока Из Результат Цикл
			НоваяЗаправка = Объект.Заправки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗаправка, ТекСтрока);
			Если НЕ Объект.УчитыватьНДС Тогда
				НоваяЗаправка.СтавкаНДС = Неопределено;
				НоваяЗаправка.СуммаНДС = 0;
			КонецЕсли;
		КонецЦикла;
		Модифицированность = Истина;
		
		//ЭлементыФормы.Заправки.ОбновитьСтроки();
    
    	НайтиЗаполнитьГСМиКарты();
    	НайтиЗаполнитьТСпоКартам();
	КонецЕсли;

	//Для Каждого ТекСтрока Из Объект.Заправки Цикл
	//	ЗаполнитьСтавкуНДСвТекущейСтроке(ТекСтрока);
	//КонецЦикла;
	
	ОбновитьВсегоВТЧЗаправки();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВсегоВТЧЗаправки()
	Для Каждого СтрокаТабличнойЧасти Из Объект.Заправки Цикл
		РассчитатьСуммуВсегоВстрокеТЧ(СтрокаТабличнойЧасти);
	КонецЦикла;
	ВывестиСуммовыеИтогиДокумента();
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуВсегоВстрокеТЧ(СтрокаТабличнойЧасти)
	СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма + ?(Объект.СуммаВключаетНДС, 0, СтрокаТабличнойЧасти.СуммаНДС);
КонецПроцедуры

&НаСервере
Процедура РассчитатьСуммуНДСвТабЧасти()
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	Для Каждого ТекСтрока Из Объект.Заправки Цикл
		уатОбщегоНазначенияТиповыеСервер.уатРассчитатьСуммуНДСТабЧасти(ТекСтрока, ДокОбъект);
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСтавкуНДСвТекущейСтроке(ТекСтрока)
	Если Объект.УчитыватьНДС Тогда
		Если НЕ ЗначениеЗаполнено(ТекСтрока.СтавкаНДС) Тогда
			ТекСтрока.СтавкаНДС = уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(ТекСтрока.ГСМ, "СтавкаНДС");
			Если НЕ ЗначениеЗаполнено(ТекСтрока.СтавкаНДС) Тогда
				ТекСтрока.СтавкаНДС = СтавкаНДСпоУмолчанию;
			КонецЕсли;
		КонецЕсли;
		РассчитатьСуммуНДСвТабЧасти();
		ОбновитьВсегоВТЧЗаправки();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтавкиНДСвСтроках(ИндексСтавки)
	Для Каждого ТекСтрока Из Объект.Заправки Цикл
		ТекСтрока.СтавкаНДС = Перечисления.СтавкиНДС.Получить(ИндексСтавки);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ВывестиСуммовыеИтогиДокумента()
	НДСВсего = Объект.Заправки.Итог("СуммаНДС");
	СуммаДокумента = Объект.Заправки.Итог("Сумма");
	Если Объект.УчитыватьНДС И НЕ Объект.СуммаВключаетНДС Тогда
		СуммаДокумента = СуммаДокумента + НДСВсего;
	КонецЕсли;
	
	Если Объект.УчитыватьНДС Тогда 
		Если Объект.СуммаВключаетНДС Тогда 
			НадписьВсегоНДС = НСтр("en='VAT amount';ru='НДС в сумме'") + ":";
		Иначе 
			НадписьВсегоНДС = НСтр("en='VAT from above';ru='НДС сверху'") + ":";
		КонецЕсли;
		НадписьВсего = НСтр("en='Total including VAT';ru='Всего с НДС'");
		Элементы.СтраницыИтогов.ТекущаяСтраница = Элементы.ИтогоУчетНДС;
	Иначе 
		НадписьВсего = НСтр("en='Total';ru='Всего'");
		Элементы.СтраницыИтогов.ТекущаяСтраница = Элементы.ИтогоБезНДС;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	
	Элементы.ЗаправкиЗаполнитьСтавкуНДС.Доступность	 = Объект.УчитыватьНДС;
	Элементы.ЗаправкиСтавкаНДС.Видимость			 = Объект.УчитыватьНДС;
	Элементы.ЗаправкиСуммаНДС.Видимость				 = Объект.УчитыватьНДС;
	Элементы.ЗаправкиВсего.Видимость				 = Объект.УчитыватьНДС;
	ВывестиСуммовыеИтогиДокумента();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПравоРедактированиеДокумента()
	Рез = ПравоДоступа("Редактирование", Метаданные.Документы.уатОтчетПоставщикаПЦ);
	Возврат Рез;
КонецФункции

&НаКлиенте
Процедура ПередЗакрытиемВопрос(Результат, ДопПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.ОК Тогда
		флВопросЗакрытиеФормы = Ложь;
		Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура КонтрольЗаполненияСтавкиНДС(Отказ, ВызовПередЗакрытиемФормы = Ложь)
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	уатОбщегоНазначения.КонтрольЗаполненияСтавкиНДС(ДокОбъект, Отказ, флВопросЗакрытиеФормы, ВызовПередЗакрытиемФормы);
КонецПроцедуры

#КонецОбласти
